app/Controllers/AdminDashboardController.php

    public function users()
    {
        $model = new UserModel();
        $users = $model->findAll();
---
SELECT *
FROM `users`