app/Controllers/Home.php

    public function login()
    {
        if($this->request->getMethod()=='get'){
            echo view('login');
        }
        else if($this->request->getMethod()=='post'){
            //validate
            if($this->validate([
                'email'=>'required',
                'password'=>'required',
            ])){
                $model= new UserModel();
                $record = $model->where('email',$this->request->getVar('email'))
                ->where('password',$this->request->getVar('password'))
                ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'aman@gmail.com'
AND `password` = '111'
 LIMIT 1